Revit 2027 API
IndependentTag.LeaderEndCondition Property
 The leader end condition of the tag, such as if the end of the leader is attached to the host or free floating.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LeaderEndCondition LeaderEndCondition { get; set; }
Public Property LeaderEndCondition As LeaderEndCondition
	Get
	Set
public:
property LeaderEndCondition LeaderEndCondition {
	LeaderEndCondition get ();
	void set (LeaderEndCondition value);
}
member LeaderEndCondition : LeaderEndCondition with get, set
Property Value
LeaderEndCondition
Exceptions
Exception | Condition
ArgumentException |  When setting this property: LeaderEndCondition can't be assigned.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  The IndependentTag object does not have a tag behavior. -or- When setting this property: For this tag leaders are not allowed.
Remarks
LeaderEndCondition enumerates the supported leader end conditions. Material tags and material keynotes can only use the free end condition.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace